# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [12]:
ser1 = pd.Series(np.random.randint(1,4,size=100))
ser2 = pd.Series(np.random.randint(1,3,size=100))
ser3 = pd.Series(np.random.randint(10000,30000,size=100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [15]:
df = pd.concat([ser1,ser2,ser3],axis=1)

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [18]:
df.columns = ["bedrs","bathrs","price_sqr_meter"]
df.head()

   bedrs  bathrs  price_sqr_meter
0      1       1            12139
1      2       1            11165
2      3       1            12013
3      2       2            24745
4      2       1            22612

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [22]:
bigcolumn = pd.concat([ser1,ser2,ser3],axis=0)
bigcolumn

0         1
1         2
2         3
3         2
4         2
      ...
95    16336
96    20229
97    20207
98    23929
99    23113
Length: 300, dtype: int32

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [26]:
bigcolumn.index.max()

np.int64(99)

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [24]:
bigcolumn.reset_index()

     index      0
0        0      1
1        1      2
2        2      3
3        3      2
4        4      2
..     ...    ...
295     95  16336
296     96  20229
297     97  20207
298     98  23929
299     99  23113

[300 rows x 2 columns]